'''
16진수 문자 1차 배열 제시.
암호 비트 패턴을 찾아 출력.

예를 들어 0DEC는 00 001101 111011 00 이 되고 암호인 0 2 출력.
'''
sc = {'001101':0, '010011':1, '111011':2, '110001':3, '100011':4, '110111':5, '001011':6, '111101':7, '011001':8, '101111':9}
ex = [32, 16, 8, 4, 2, 1]
for testcase in range(1, int(input())+1):
    a = bin(int(input(), 16))[2:]
    while a[-1] == '0':
        a = a[:-1]
    while len(a) % 6:
        a = '0'+a
    print(f"#{testcase}", end=' ')
    for i in range(0, len(a), 6):
        ans = 0
        l = a[i:i+6]
        print(sc[l], end=' ')
    print()